# ExportLinetypeInfo Class

---
A value used to represent the info stored in the ExportLinetypeTable.
SystemObject Autodesk.Revit.DBExportLinetypeInfo
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ExportLinetypeInfo : IDisposable

    Public Class ExportLinetypeInfo
    	Implements IDisposable

    public ref class ExportLinetypeInfo : IDisposable

    type ExportLinetypeInfo =
        class
            interface IDisposable
        end
The ExportLinetypeInfo type exposes the following members.
| Name| Description
---|---|---
| ExportLinetypeInfo|  Constructs a new default ExportLinetypeInfo.
| ExportLinetypeInfo(ExportLinetypeInfo)|  Constructs a new copy of the input ExportLinetypeInfo object.
| ExportLinetypeInfo(String)|  Constructs a new ExportLinetypeInfo using the destination linetype name as input.
Top
| Name| Description
---|---|---
| DestinationLinetypeName|  The destination linetype name (the name of the linetype in the exported format).
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ExportLinetypeInfo
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace